tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/services"
tap "teamookla/speedtest"
# General-purpose data compression with high compression ratio
brew "xz"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Create and view interactive cheat sheets for *nix commands
brew "cheat"
# Command-line csv viewer
brew "csvlens"
# Load/unload environment variables based on $PWD
brew "direnv"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Terminal JSON viewer
brew "fx"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Command-line benchmarking tool
brew "hyperfine"
# Lightweight and flexible command-line JSON processor
brew "jq"
# GNOME XML library
brew "libxml2"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# General-purpose scripting language
brew "php"
# Modern replacement for ps written in Rust
brew "procs"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Official tldr client written in Rust
brew "tlrc"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Password manager that keeps all passwords secure behind one password
cask "1password@7"
# Application launcher and productivity software
cask "alfred"
# Menu bar icon organiser
cask "bartender"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Disk space visualiser
cask "daisydisk"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# Utility to move and zoom windows—on one display
cask "moom"
# Text editor for code, markup and prose
cask "sublime-text"
mas "1Blocker", id: 1365531024
mas "Baking Soda", id: 1601151613
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "JSONPeep", id: 1458969831
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Slack", id: 803453959
mas "ToothFairy", id: 1191449274
mas "Vinegar", id: 1591303229
mas "WiFi Scanner", id: 411680127
mas "Xcode", id: 497799835
